<br><br><center><h1 style="font-size:2em;color:green">Lernkontrolle 1: Numpy & Pandas</h1></center>
<br>
<center>Die möglichen Punkte stehen bei der jeweiligen Aufgabe dabei</center>

In [1]:
from operator import index
from unittest.mock import inplace

# Deine Imports hier:
# (bitte NUR hier, sonst gibt es in Zukunft dafür Punktabzug!)

import numpy as np
import pandas as pd
import seaborn as sns

# Aufgabe 1

1. Du hast einen Musikladen. Schreibe eine pandas-Series mit Instrumenten und vorrätigen Stückzahlen. Orientiere dich am nachfolgenden Output. Gib der Series den Namen 'quantity'! 8 Pkt


Output:

|            | Quantity |
|------------|----------|
| Klavier    | 12       |
| Gitarre    | 32       |
| Harfe      | 1        |
| Schlagzeug | 32       |
| Triangel   | 9        |

Name: quantity, dtype: int64

In [2]:
music_store = pd.Series(
    data=[12, 32, 1, 32, 9],
    index=['Klavier', 'Gitarre', 'Harfe', 'Schlagzeug', 'Triangel'],
    name='quantity'
)

music_store

Klavier       12
Gitarre       32
Harfe          1
Schlagzeug    32
Triangel       9
Name: quantity, dtype: int64

2. Du hast die Preise vergessen. So viel kostet jeweils ein Instrument:

    Klavier       1200
    Gitarre      800
    Harfe        2500
    Schlagzeug   450
    Triangel      25

Ja, die Triangel ist viel zu teuer, aber darum geht es nicht.
Sondern du sollst mal wieder eine Series namens `price` produzieren und diese danach mit der vorigen Series zu einem DataFrame namens `music_shop` verbinden.


8 Pkt.

    Output:
|            | Quantity | Price |
|------------|----------|-------|
| Klavier    | 12       | 1200  |
| Gitarre    | 32       | 800   |
| Harfe      | 1        | 2500  |
| Schlagzeug | 32       | 450   |
| Triangel   | 9        | 25    |

In [3]:
price = pd.Series(
    data=[1200, 800, 2500, 450, 25],
    index=['Klavier', 'Gitarre', 'Harfe', 'Schlagzeug', 'Triangel'],
    name='price'
)

music_shop = pd.concat([music_store, price], axis=1, ignore_index=False)
music_shop

            quantity  price
Klavier           12   1200
Gitarre           32    800
Harfe              1   2500
Schlagzeug        32    450
Triangel           9     25

3. Sortiere den Index neu, damit die Instrumente in der korrekten alphabetischen Reihenfolge aufgeführt werden. Der DataFrame soll die Veränderungen übernehmen!

4 Pkt

In [11]:
music_shop.sort_index(inplace=True)
music_shop

   instrument  quantity  price
0     Gitarre        32    800
1       Harfe         1   2500
2     Klavier        12   1200
3  Schlagzeug        32    450
4    Triangel         9     25

4. Du möchtest nicht mehr die Instrumentennamen im Index haben, sondern diese als weitere Spalte im DataFrame namens 'instrument' führen. Der Index soll ein ganz normaler numerischer fortlaufender Index sein. Wie löst du das? Bonus: Wenn du es in einer Zeile hinkriegst, gibt es zwei Bonuspunkte ;)

8 Pkt (+ 2 Bonus)

In [12]:
music_shop.rename(columns={'index': 'instrument'}, inplace=True)
music_shop

   instrument  quantity  price
0     Gitarre        32    800
1       Harfe         1   2500
2     Klavier        12   1200
3  Schlagzeug        32    450
4    Triangel         9     25

5. Du hast dich umorientiert und bist jetzt Autohändler. Erstelle einen DataFrame mit fünf Autos. Folgende Informationen sollen für jedes Auto enthalten sein:

   1. Marke
   2. Modell
   3. Farbe
   4. PS

Die Informationen dazu können frei erfunden sein. Eine Bedingung gibt es aber: Die Informationen müssen als Dictionary verfasst werden und dann dem DataFrame übergeben werden.

Lass dir schließlich den DataFrame ausgeben. 8 Pkt

    Output:

| Marke  | Modell     | Farbe  | PS  |
|--------|------------|--------|-----|
| BMW    | 2er Coupé  | Schwarz| 116 |
| Audi   | A1         | Rot    | 95  |
| Ford   | Mustang    | Grün   | 449 |
| VW     | Golf 6     | Blau   | 80  |
| Mazda  | RX-8       | Silber | 231 |

In [16]:
muscle_cars = [
    {
        "Marke": "Ford",
        "Modell": "Mustang Shelby GT500",
        "Farbe": "Blau mit weißen Streifen",
        "PS": 760
    },
    {
        "Marke": "Chevrolet",
        "Modell": "Camaro ZL1",
        "Farbe": "Schwarz",
        "PS": 650
    },
    {
        "Marke": "Dodge",
        "Modell": "Challenger SRT Hellcat",
        "Farbe": "Matt-Schwarz",
        "PS": 717
    },
    {
        "Marke": "Pontiac",
        "Modell": "GTO Judge",
        "Farbe": "Orange",
        "PS": 366
    },
    {
        "Marke": "Plymouth",
        "Modell": "Barracuda HEMI",
        "Farbe": "Gelb",
        "PS": 425
    }
]
muscle_cars_df = pd.DataFrame(muscle_cars).set_index('Marke')
muscle_cars_df

                           Modell                     Farbe   PS
Marke
Ford         Mustang Shelby GT500  Blau mit weißen Streifen  760
Chevrolet              Camaro ZL1                   Schwarz  650
Dodge      Challenger SRT Hellcat              Matt-Schwarz  717
Pontiac                 GTO Judge                    Orange  366
Plymouth           Barracuda HEMI                      Gelb  425

6. Lass dir nur die beiden Spalten Modell und Marke des Autodataframes ausgeben. 4 Pkt

In [24]:
muscle_cars_df[["Modell"]]

                           Modell
Marke
Ford         Mustang Shelby GT500
Chevrolet              Camaro ZL1
Dodge      Challenger SRT Hellcat
Pontiac                 GTO Judge
Plymouth           Barracuda HEMI

7. Lass dir nur die Autos ausgeben, die eine PS Zahl von mehr als 200 haben. 6 Pkt

In [28]:
# Ich mach mal lieber > 500 PS 🤣
muscle_cars_df[muscle_cars_df['PS'] > 500]

                           Modell                     Farbe   PS
Marke
Ford         Mustang Shelby GT500  Blau mit weißen Streifen  760
Chevrolet              Camaro ZL1                   Schwarz  650
Dodge      Challenger SRT Hellcat              Matt-Schwarz  717

8. Sortiere die Autos nun absteigend nach Pferdestärken. Überschreibe den DataFrame durch die neue Sortierung. 6 Pkt

    Output:

| Marke  | Modell     | Farbe  | PS  |
|--------|------------|--------|-----|
| Ford   | Mustang    | Grün   | 449 |
| Mazda  | RX-8       | Silber | 231 |
| BMW    | 2er Coupé  | Schwarz| 116 |
| Audi   | A1         | Rot    | 95  |
| VW     | Golf 6     | Blau   | 80  |

In [29]:
muscle_cars_df.sort_values(by='PS', ascending=False)

                           Modell                     Farbe   PS
Marke
Ford         Mustang Shelby GT500  Blau mit weißen Streifen  760
Dodge      Challenger SRT Hellcat              Matt-Schwarz  717
Chevrolet              Camaro ZL1                   Schwarz  650
Plymouth           Barracuda HEMI                      Gelb  425
Pontiac                 GTO Judge                    Orange  366

9. Der nachfolgende Code importiert dir den Datensatz 'iris' (wenn oben in den Imports seaborn als sns importiert wurde).

Lass dir die oberen 7 Einträge anzeigen.

4 Pkt

In [30]:
iris = sns.load_dataset("iris")

In [43]:
iris.head(7)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa

10. Lass dir eine statistische Zusammenfassung der numerischen Spalten geben.

2 Pkt

In [32]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

11. Welche Schwertlilien-Arten (mit Namen) gibt es im Datensatz?

4 Pkt

In [37]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

12. Wie oft kommen die verschiedenen Vertreter vor? (absolute Zahlen)

4 Pkt

In [38]:
iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

13. Dich interessieren nur Daten der Art setosa, die eine Kelchblattlänge (Kelchblatt = sepal) ab 5.5 cm aufwärts haben. Lasse dir den entsprechenden Ausschnitt der Daten ausgeben.

6 Pkt

In [45]:
iris[(iris['species'] == 'setosa') & (iris['sepal_length'] > 5.5)]

    sepal_length  sepal_width  petal_length  petal_width species
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
18           5.7          3.8           1.7          0.3  setosa

14. Dich interessieren alle Pflanzen, deren Blütenblattbreite sich zwischen 1.2 und 1.3 cm bewegt.

4 Pkt

In [48]:
iris[iris['petal_width'].between(1.2 ,1.3)]

    sepal_length  sepal_width  petal_length  petal_width     species
53           5.5          2.3           4.0          1.3  versicolor
55           5.7          2.8           4.5          1.3  versicolor
58           6.6          2.9           4.6          1.3  versicolor
64           5.6          2.9           3.6          1.3  versicolor
71           6.1          2.8           4.0          1.3  versicolor
73           6.1          2.8           4.7          1.2  versicolor
74           6.4          2.9           4.3          1.3  versicolor
82           5.8          2.7           3.9          1.2  versicolor
87           6.3          2.3           4.4          1.3  versicolor
88           5.6          3.0           4.1          1.3  versicolor
89           5.5          2.5           4.0          1.3  versicolor
90           5.5          2.6           4.4          1.2  versicolor
92           5.8          2.6           4.0          1.2  versicolor
94           5.6          2.7           4.2          1.3  versicolor
95           5.7          3.0           4.2          1.2  versicolor
96           5.7          2.9           4.2          1.3  versicolor
97           6.2          2.9           4.3          1.3  versicolor
99           5.7          2.8           4.1          1.3  versicolor

15. Wähle folgenden Ausschnitt der Daten aus:

Spalten: 'species', 'sepal_length', 'sepal_width'

Zeilen: 100-120 (Ende inklusive)

6 Pkt

In [49]:
iris.loc[100:120, ['species', 'sepal_length', 'sepal_width']]

       species  sepal_length  sepal_width
100  virginica           6.3          3.3
101  virginica           5.8          2.7
102  virginica           7.1          3.0
103  virginica           6.3          2.9
104  virginica           6.5          3.0
105  virginica           7.6          3.0
106  virginica           4.9          2.5
107  virginica           7.3          2.9
108  virginica           6.7          2.5
109  virginica           7.2          3.6
110  virginica           6.5          3.2
111  virginica           6.4          2.7
112  virginica           6.8          3.0
113  virginica           5.7          2.5
114  virginica           5.8          2.8
115  virginica           6.4          3.2
116  virginica           6.5          3.0
117  virginica           7.7          3.8
118  virginica           7.7          2.6
119  virginica           6.0          2.2
120  virginica           6.9          3.2

16. Time to join forces.

Der nachfolgende Code erzeugt dir drei DataFrames.

Deine erste Aufgabe: Führe employees über die IDs der Mitarbeiter mit salaries zusammen und speicher das Ergebnis in 'employees_details'.

6 Pkt

In [80]:
employees_data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': [1, 2, 3, 2, 1],
    'Salary': [50000, 60000, 55000, 70000, 52000]
}

salaries_data = {
    'Year': [2023, 2023, 2023, 2023, 2023],
    'Salary_Adjustment': [2000, 2500, 1500, 3000, 2200]
}

departments_data = {
    'Department_ID': [1, 2, 3, 4],
    'Department_Name': ['HR', 'IT', 'Marketing', 'Finance'],
    'Location': ['New York', 'San Francisco', 'Chicago', 'Los Angeles'],
    'Budget': [500000, 1200000, 750000, 950000],
    'Manager_ID': [201, 202, 203, 204]
}

employees = pd.DataFrame(employees_data)
salaries = pd.DataFrame(salaries_data,                          
                        index=[101, 102, 103, 104, 105])
departments = pd.DataFrame(departments_data)

In [81]:
employees_details = employees.merge(salaries, left_on='ID', right_index=True)
employees_details

    ID     Name  Department  Salary  Year  Salary_Adjustment
0  101    Alice           1   50000  2023               2000
1  102      Bob           2   60000  2023               2500
2  103  Charlie           3   55000  2023               1500
3  104    David           2   70000  2023               3000
4  105      Eve           1   52000  2023               2200

17. Jetzt hättest du noch gern zusätzlich die Informationen über die Departments in den Tabellen, zu denen die aufgeführten Mitarbeiter gehören. Führe 'employees_details' und 'departments' so zusammen, dass auch diese Infos vorliegen. Überschreibe employees_details mit dem Ergebnis des Zusammenführens.

6 Pkt

In [82]:
employees_details = employees_details.merge(departments, left_on='Department', right_on='Department_ID')
employees_details

,ID,Name,Department,Salary,Year,Salary_Adjustment,Department_ID,Department_Name,Location,Budget,Manager_ID
0,101,Alice,1,50000,2023,2000,1,HR,New York,500000,201
1,102,Bob,2,60000,2023,2500,2,IT,San Francisco,1200000,202
2,103,Charlie,3,55000,2023,1500,3,Marketing,Chicago,750000,203
3,104,David,2,70000,2023,3000,2,IT,San Francisco,1200000,202
4,105,Eve,1,52000,2023,2200,1,HR,New York,500000,201

18. Entferne alle ID-Spalten aus dem DataFrame und überschreibe 'employees_details' mit dem resultierenden Dataframe.

2 Pkt

In [83]:
employees_details.drop('ID', axis=1, inplace=True)
employees_details

,Name,Department,Salary,Year,Salary_Adjustment,Department_ID,Department_Name,Location,Budget,Manager_ID
0,Alice,1,50000,2023,2000,1,HR,New York,500000,201
1,Bob,2,60000,2023,2500,2,IT,San Francisco,1200000,202
2,Charlie,3,55000,2023,1500,3,Marketing,Chicago,750000,203
3,David,2,70000,2023,3000,2,IT,San Francisco,1200000,202
4,Eve,1,52000,2023,2200,1,HR,New York,500000,201

19. Lasse mit Pandasmitteln dir folgende drei Sachen ausgeben:
* Das niedrigste und das höchste Budget
* Das mittlere Gehalt

4 Pkt

In [84]:
employees_details['Budget'].min()

np.int64(500000)

In [85]:
employees_details['Budget'].max()

np.int64(1200000)

In [86]:
employees_details['Budget'].mean()

np.float64(830000.0)